[
    {
        "title": "NASA Ames Research Center",
        "publishDate": "Sep 20, 2023",
        "tags": "Astronomy, Space",
        "image": [
            "../images/NASA/jameswebb-image.png",
            "../images/NASA/nasa-ames.png",
            "../images/NASA/exoplanet-png.png"
        ],
        "position": "Machine Learning Intern",
        "workType": "Machine Learning, AI",
        "location": "Mountain View, CA",
        "dates": "Sep 2023 - Dec 2023",
        "objective": "Harnessing the power of machine learning (ML) and data from the James Webb Space Telescope (JWST) to predict atmospheric features of exoplanets, with the goal of potentially finding signs of life beyond our planet.",
        "technologies": ["[COMING SOON]"],
        "summary": ["[COMING SOON]", ""]
    },
    {
        "title": "Alexa",
        "publishDate": "Sep 18, 2023",
        "tags": "Artificial Intelligence, Internet of Things (IOT)",
        "image": [
            "../images/Alexa/alexa-multidevice.png",
            "../images/Alexa/iot.png",
            "../images/Alexa/alexa-echo.png"
        ],
        "position": "Software Engineer Intern",
        "workType": "Machine Learning, AI",
        "location": "Sunnyvale, CA",
        "dates": "Jun 2023 - Sep 2023",
        "objective": "Leveraged systems design and backend engineering to improve machine learning (ML) workflow and device arbitration in a multi-device environment for millions of Alexa customers.",
        "technologies": ["TypeScript, Java, AWS DynamoDB, AWS AppConfig, AWS CloudFormation"],
        "summary":["The summer after my junior year, I had the opportunity to return to Amazon and work on the AI virtual assistant Alexa. Alexa is the world's most famous virtual assistant, used by over half a billion devices around the world (Sept 2022). Alexa is used across a variety of enabled devices (Fire, Echo, Sonos, BMW Auto, etc) and was even aboard NASA's Artemis I rocket! Although Alexa may seem simple from a device standpoint, the infrastructure to support her involves a massive cloud platform with many microservices operating with different purposes and technical challenges.", "As an intern, I had the priviledge to work with the Alexa Echo Spatial Perception (ESP) team. ESP works on Echo Spatial Perception (ESP), an Alexa feature that figures out where the user is and which device is closest to listen to the user's request. This process involves ML-based models and services to arbitrate this \"winning\" device, one of which is Alexa Spatial Perception (ASP): a microservice that uses incremental audio information and algorithms to \"learn\" a multi-device environment. My project as an intern involved improving this part of the workflow used to \"learn\" a customer's multi-device environment by detecting device movement and as a result, enable ML-based ESP to better determine the optimal listening device. This improvement involved developing a production-ready REST API, highly available NoSQL data store, and integrating these components into the device movement detection workflow in order to enable batch processing of device triggers (device events that 'trigger' a workflow). In addition, extensive automated testing and real-world device testing/data gathering were performed to validate this approach and ensure it met the high performance bar set on behalf of customers. This enhancement of device movement detection in ASP was set to be productionized and make a real difference for hundreds of millions of Alexa devices. All in all, this opportunity with Alexa at Amazon introduced me to topics in Machine Learning & AI, while fostering my interest in distributed systems and Internet of Things (IOT)."]
    },
    {
        "title": "Arista Networks",
        "publishDate": "Jun 25, 2023",
        "tags": "Networking, Operating Systems",
        "image": [
            "../images/Arista_Networks/networking.png",
            "../images/Arista_Networks/arista-hq.png",
            "../images/Arista_Networks/routing.png"
        ],
        "position": "Software Engineer Intern",
        "workType": "Software Defined Networking",
        "location": "Santa Clara, CA",
        "dates": "Apr 2023 - Jun 2023",
        "objective": "Used software-defined networking (SDN) to improve the performance and support of Arista's EOS routing engine, enabling it to scale and meet the demands of the world's biggest cloud data centers.",
        "technologies": ["Python, C++, Linux"],
        "summary": ["During my junior year of college, I had the opportunity to take a step back from my studies and work on routing software at Arista Networks. Arista Networks is a global leader in networking, specifically data-driven cloud networking. Customers across the world, from college campuses to the world's largest cloud providers, work with Arista Networks to scale and address their networking challenges. Arista Networks is best known for their Extensible Operating System (EOS), a cloud-based network operating system that supports infrastructure critical to massive corporate data centers and even the internet itself.", "As an intern under the EOS Routing Protocols team, I was tasked with several projects that aimed to improve the performance and support of the EOS forwarding plane. First, I had to optimize a virtual routing tool command, by refactoring code and leveraging in memory caching. Second, I improved the performance of Arista's Forwarding Agent (ARFA) by caching packet header information for optimal use within the UDP Packet Parser. Lastly, I worked on a FAANG company feature request involving MPLS Nexthop Group Support for IPv6 Link-Local Addresses in cEOS (containerized EOS). This was one of the most challenging projects, as it involved working in and understanding the inner workings of multiple agents (company language for OS processes). MPLS (Multi-Label Protocol Switching) is an alternative to IP, in which routing is connection-oriented and packets are routed based on preconfigured label-switched paths. Link-Local addresses are a popular technique used in large data centers to have statically configured Layer-3 addresses for nodes (hosts, routers) and avoid the latency of having to dynamically configure an address with a DHCP server at scale. In this project, several agents had to be refactored to handle link-local addressing, including selectively updating layer 2 and layer 3 metadata (tables, mappings) due to the nature of link-local addresses. Since this was a customer request, extensive testing had to be done to ensure the highest quality of software support. In the end, the project was set to be introduced in Arista's next OS release and the specific customers (FAANG) were planning to utilize it to test network topologies at cloud titan scale. All in all, my time at Arista was very insightful, in which I learned a lot about software-defined networking, low-level software development, and making a real difference for a company who's products we all use today!"]
    },
    {
        "title": "Amazon Web Services",
        "publishDate": "Sep 12, 2022",
        "tags": "Cloud, Websites",
        "image": [
            "../images/AWS/aws-silk-logo.png",
            "../images/AWS/amazon-silk-browser.png",
            "../images/AWS/aws-cloud.png"
        ],
        "position": "Software Engineer Intern",
        "workType": "Full-Stack, Cloud",
        "location": "Seattle, WA",
        "dates": "Jun 2022 - Sep 2022",
        "objective": "Streamlined browser performance analysis with cloud computing and full-stack development, enhancing the user experience for millions of people on Amazon Silk.",
        "technologies": ["HTML, CSS, ReactJS, Python, AWS S3, AWS CloudFront, AWS WAF, AWS Route53, AWS Workspaces"],
        "summary": ["The summer after my sophomore year of college, I had the opportunity to work at Amazon Web Services and contribute to services impacting millions of customers. Amazon Web Services, or most commonly known as AWS, is the world's leading cloud provider. AWS offers an extensive suite of cloud services for customers around the world, including application software for different devices. One of these applications is Amazon Silk, a browser used by millions of people across a variety of Amazon devices like FireTV, Fire Tablets, Echo Show, etc.", "As an intern on the Amazon Silk Team, I was tasked with building an internal tool that could help developers better analyze Silk Browser metrics. Previously Silk Engineers would find themselves having to manually configure settings, browse through thousands to millions of graphs and prune through different graph types. With my full-stack web application, manual overhead was significantly reduced by displaying graphs to choose from, preconfiguring settings, and including important metadata not seen before. This solution involved a complex system of frontend and backend technologies, all integrated with internal tools and deployed to the AWS Cloud. HTML, CSS, and ReactJS were used to bring forth a vibrant interface, while Python and internal tools were used to periodically update the backend information routed internally. This tool was then deployed to the cloud: being hosted in AWS S3, distributed globally through AWS CloudFront, DNS configured with AWS Route53, and had firewall management with AWS WAF. In the end, I was able to deliver a tool that would encourage Silk Engineers to explore data representing the experience of millions of Silk customers. Overall I thought my time at Amazon was very challenging, opening my eyes to topics like System Design, Full-Stack Development and working in a fast paced innovative environment."]
    },
    {
        "title": "Insane Ink",
        "publishDate": "Aug 3, 2020",
        "tags": "Business, Apparel",
        "image": [
            "../images/ui-project-1.jpg",
            "../images/web-project-2.jpg",
            "../images/mobile-project-2.jpg"
        ],
        "position": "Webmaster",
        "workType": "Website Development",
        "location": "San Jose, CA",
        "dates": "Sep 2019 - Jun 2020",
        "objective": "Made various improvements to the Insane Ink website to improve site navigation, usage, and apparel visibility.",
        "technologies": ["HTML, CSS, JavaScript"],
        "summary": ["As a senior, my high school had a class 'Economics of Business Ownership' where students would learn the basics of business economics, while running an apparel business serving our local community.", "The business would have many orders for neighboring schools, public universities/businesses and we had to manage the whole process. I was given the opportunity to be the webmaster, alongside a member of the board, where I would contribute to vital marketing decisions. My work on www.insaneink.com included general upkeep, debugging/cleaning up code, and communicating with other departments. Additionally, I went above and beyond by revamping the site navigation bar (with a drop-down), adding a customer feedback form that would send responses directly to Google Sheets, as well as various other technical improvements to the site. At the end of the year, I was given an academic award for my outstanding work on the site. My time in Insane Ink was a valuable experience, as I learned a lot about front-end development and being a business leader."]
    }
]